#!/usr/bin/python3
f1=1            #1 число
f2=1            #2 число

n=int(input("Введіть N: "))             #ввыд до якого числа рахувати (по порядку)

print(f1)                               #вивыд 1 числа
print(f2)                               #вивыд 2 числа  

while n > 2:                                #функцыя для виводу наступних чисел через while
    f1,f2=f2, f2+f1                         #присвоєння значень через кому теж можна
    print(f2)
    n -= 1

print("====================")


f1=1              #1 число
f2=1              #2 число

n=int(input("Введіть N: "))             #ввыд до якого числа рахувати (по порядку)

print(f1)                               #вивыд 1 числа
print(f2)                               #вивыд 2 числа

for i in range (2,n):                        #функцыя для виводу наступних чисел через for
    f1,f2=f2, f2+f1                          #присвоєння значень через кому теж можна
    print(f2)
    n -= 1
